In [1]:
import pandas as pd
import datetime

In [55]:
d_parse = lambda x: datetime.datetime.strptime(x,'%Y-%m-%d')
stocks = pd.read_csv('https://bit.ly/smallstocks', parse_dates=['Date'],
                    date_parser=d_parse)

In [3]:
stocks

        Date   Close    Volume Symbol
0 2016-10-03   31.50  14070500   CSCO
1 2016-10-03  112.52  21701800   AAPL
2 2016-10-03   57.42  19189500   MSFT
3 2016-10-04  113.00  29736800   AAPL
4 2016-10-04   57.24  20085900   MSFT
5 2016-10-04   31.35  18460400   CSCO
6 2016-10-05   57.64  16726400   MSFT
7 2016-10-05   31.59  11808600   CSCO
8 2016-10-05  113.05  21453100   AAPL

In [7]:
stocks.loc[0,'Date'].day_name()

'Monday'

In [8]:
stocks.index

RangeIndex(start=0, stop=9, step=1)

In [10]:
stocks.groupby(by=['Symbol'])['Close'].mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [14]:
# this is a series with multi-index
# Symbol is outer Date is inner index
ser = stocks.groupby(by= ['Symbol','Date'])['Close'].mean()
type(ser)

pandas.core.series.Series

In [13]:
ser.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [26]:
# unstack multi-indexes series --> DataFrame
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [17]:
# unstack multi-indexes series --> DataFrame
df = stocks.pivot_table(values='Close',index='Symbol',columns='Date',
                   aggfunc='mean')

In [28]:
# select multi-indexes Series
# select all stocks of Apple
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [30]:
# select stock of Apple on specific date
ser.loc['AAPL','2016-10-03']

112.52

In [49]:
# select all stocks from specific date
ser.loc[:,'2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

In [57]:
# dateframe multi-index
stocks.set_index(['Symbol','Date'], inplace=True)

In [52]:
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [59]:
stocks.sort_index(inplace=True)

In [60]:
# Sort by outer and inner 
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [77]:
# select multi-indexes
stocks.loc['AAPL']['2016-10-03':'2016-10-04']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800

In [67]:
# select outer and inner in tuple to call other columns
stocks.loc[('AAPL','2016-10-03'),'Close']

Symbol  Date
AAPL    2016-10-03    112.52
Name: Close, dtype: float64

In [71]:
# select with multi stocks
stocks.loc[(['AAPL','MSFT'],'2016-10-03'),'Close']

Symbol  Date
AAPL    2016-10-03    112.52
MSFT    2016-10-03     57.42
Name: Close, dtype: float64

In [80]:
# select stocks of apple with multi-dates
stocks.loc[('AAPL',['2016-10-03','2016-10-04']),'Close']

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
Name: Close, dtype: float64

In [85]:
# select all stock with multi-dates
stocks.loc[(slice(None),['2016-10-03','2016-10-04']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900